ednieuw/ESP32Communications/ESP32Arduino_CommV08/ESP32Arduino_CommV08.ino
    case 'R':                                                                                 // Reset to default settings
      if(InputString.equals("RRRRR"))                                                                                  // Delete WIFI settings and set defaults
      {
        Reset();
        ResetCredentials();
        ESP.restart();
        break;
      }
      if(InputString.equals("RRR"))                                                                                  // Delete WIFI settings only
       { 
        ResetCredentials();
        sprintf(sptext, "\nSSID and password deleted. \nWIFI, NTP and BLE is On\n Enter @ to restart");
        break;
       }
      if(len == 1)                                                                                  // Set to default settings
        {
        Reset();
        sprintf(sptext, "\nReset to default values: Done");
        lastminute = 99;
        Displaytime();
       } 
      else sprintf(sptext, "**** Length fault R. ****");
      break;
      
    case 'S':                                                                                 // Slope factor for brightness
      validLength = (len > 1 && len < 5);
      if(validLength) 
       {
        Mem.LightReducer = (byte)SConstrainInt(InputString, 1, 1, 255);
        sprintf(sptext, "Slope brightness changed to: %d%%", Mem.LightReducer);
       } 
      else sprintf(sptext, "**** Input fault. \nEnter Snnn where n between 1 and 255");
      break;
      
    case 'T':                                                                                 // Time setting
      if(len == 7) 
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 1, 3, 0, 23);
        timeinfo.tm_min = (int)SConstrainInt(InputString, 3, 5, 0, 59);
        timeinfo.tm_sec = (int)SConstrainInt(InputString, 5, 7, 0, 59);
        if(DS3231Installed) 
         {
          sprintf(sptext, "Time set in external RTC module");
          SetDS3231Time();
          PrintDS3231Time();
         } 
        else sprintf(sptext, "No external RTC module detected");
       } 
      else sprintf(sptext, "**** Length fault. Enter Thhmmss ****");
      break;

    case 'W':                                                                                 // WIFI toggle
      if(len == 1) 
       {
        Mem.WIFIOn = 1 - Mem.WIFIOn;
        Mem.NTPOn = Mem.WIFIOn;                                                               // If WIFI is off turn NTP also off
        sprintf(sptext, "WIFI is %s after restart", Mem.WIFIOn ? "ON" : "OFF");
       } 
      else sprintf(sptext, "**** Length fault. Enter W ****");
      break;
      
    case 'X':                                                                                 // NTP toggle
      if(len == 1) 
       {
        Mem.NTPOn = 1 - Mem.NTPOn;
        sprintf(sptext, "NTP is %s after restart", Mem.NTPOn ? "ON" : "OFF");
       } 
      else sprintf(sptext, "**** Length fault. Enter X ****");
      break;
      
    case 'Z':                                                                                 // Start WPS
      sprintf(sptext, "**** Start WPS on your router");
      WiFi.onEvent(WiFiEvent);
      WiFi.mode(WIFI_STA);
      Serial.println("Starting WPS");
      wpsInitConfig();
      wpsStart();
      break;
      
    case '!':                                                                                 // Print times
      if(len == 1) PrintAllClockTimes();
      sprintf(sptext,"\n");
      break;
      
    case '@':                                                                                 // Reset ESP
      if(len == 1) 
       {
        Tekstprintln("\n*********\n ESP restarting\n*********\n");
        ESP.restart();
       } 
      else sprintf(sptext, "**** Length fault. Enter @ ****");
      break;
  
    case '&':                                                                                 // Force NTP update
      if(len == 1) 
       {
        SetDS3231Time();
        SetRTCTime();
        PrintAllClockTimes();
        sprintf(sptext,"\n");
       } 
      else sprintf(sptext, "**** Length fault &. ****");
      break;
 
     case '%':                                                                                 // LED strip type
      if(len == 1) 
       {
        Mem.LEDstrip = 1 - Mem.LEDstrip;
        sprintf(sptext, "LED strip is %s after restart", Mem.LEDstrip ? "WS2812" : "SK6812");
       } 
      else sprintf(sptext, "**** Length fault . ****");
      break;     
 
    case '+':                                                                                 // BLE string toggle
      if(len == 1) 
       {
        Mem.UseBLELongString = 1 - Mem.UseBLELongString;
        sprintf(sptext, "Fast BLE is %s", Mem.UseBLELongString ? "ON" : "OFF");
       } 
      else sprintf(sptext, "**** Length fault. Enter + ****");
      break;
      

    case '=':                                                                                 // Print permanent Mem memory
      if(len == 1)  PrintMem(); 
      else sprintf(sptext, "**** Length fault. Enter = ****");
      break;     

    case '0': case '1': case '2':                                                             // Time entry compatibility mode
      if(len == 6) 
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 0, 2, 0, 23);
        timeinfo.tm_min = (int)SConstrainInt(InputString, 2, 4, 0, 59);
        timeinfo.tm_sec = (int)SConstrainInt(InputString, 4, 6, 0, 59);
        if(DS3231Installed) 
         {
          sprintf(sptext, "Time set in external RTC module");
          SetDS3231Time();
          PrintDS3231Time();
         } 
        else sprintf(sptext, "No external RTC module detected");
       }   
      else sprintf(sptext, "**** Length fault. Enter Thhmmss ****");
      break;
  }
  Tekstprintln(sptext);
  StoreStructInFlashMemory();                                                                 // Update EEPROM
}
InputString = "";
}

//--------------------------------------------                                                //
// COMMON Print Display choice
// Default print the text
//--------------------------------------------
void PrintDisplayChoice() {PrintDisplayChoice(true);}
void PrintDisplayChoice(bool PrintIt)
{
 byte dp = Mem.DisplayChoice;
 sprintf(sptext,"Display choice: %s",
        dp==0?"Yellow+":dp==1?"Hourly":dp==2?"White"  :dp==3?"All Own":
        dp==4?"Own+"   :dp==5?"Wheel" :dp==6?"Digital":dp==7?"Hourly+":
        dp==8?"Rainbow":      "NOP");        
 if (PrintIt) Tekstprintln(sptext);
}
//--------------------------------------------                                                //
// COMMON Print permanent Mem memory
//--------------------------------------------
void PrintMem(void)
{
 //PrintDisplayChoice();
 sprintf(sptext," TurnOffLEDsAtHH: %d",Mem.TurnOffLEDsAtHH);                Tekstprintln(sptext);
 sprintf(sptext,"  TurnOnLEDsAtHH: %d",Mem.TurnOnLEDsAtHH);                 Tekstprintln(sptext);
 sprintf(sptext,"  LanguageChoice: %d",Mem.LanguageChoice);                 Tekstprintln(sptext);
 sprintf(sptext,"    LightReducer: %d",Mem.LightReducer);                   Tekstprintln(sptext);
 sprintf(sptext," LowerBrightness: %d",Mem.LowerBrightness);                Tekstprintln(sptext);
 sprintf(sptext," UpperBrightness: %d",Mem.UpperBrightness);                Tekstprintln(sptext);
 for (int i=0;i<12;i++) { sprintf(sptext,"%03d ",Mem.NVRAMmem[i]);          Tekstprint(sptext); }   Tekstprintln("");
 for (int i=12;i<24;i++){ sprintf(sptext,"%03d ",Mem.NVRAMmem[i]);          Tekstprint(sptext); }   Tekstprintln("");
 sprintf(sptext,"   DisplayChoice: %d",Mem.DisplayChoice);                  Tekstprintln(sptext);                                                                   
 sprintf(sptext,"           BLEOn: %s",Mem.BLEOn ? "ON" : "OFF");           Tekstprintln(sptext);
 sprintf(sptext,"           NTPOn: %s",Mem.NTPOn ? "ON" : "OFF");           Tekstprintln(sptext);
 sprintf(sptext,"          WIFIOn: %s",Mem.WIFIOn ? "ON" : "OFF");          Tekstprintln(sptext);
 sprintf(sptext,"     StatusLEDOn: %s",Mem.StatusLEDOn ? "ON" : "OFF");     Tekstprintln(sptext);
 sprintf(sptext,"    MCUrestarted: %d",Mem.MCUrestarted );                  Tekstprintln(sptext);                                              
// sprintf(sptext,"         DCF77On: %s",Mem.DCF77On  ? "ON" : "OFF");        Tekstprintln(sptext);
 sprintf(sptext,"       UseRotary: %s",Mem.UseRotary ? "ON" : "OFF");       Tekstprintln(sptext);
 sprintf(sptext,"       UseDS3231: %s",Mem.UseDS3231 ? "ON" : "OFF");       Tekstprintln(sptext);
 sprintf(sptext,"       LED strip: %s", Mem.LEDstrip?"WS2812":"SK6812" );   Tekstprintln(sptext);
// sprintf(sptext,"      FiboChrono: %s",Mem.FiboChrono ? "FIBO" : "CHRONO"); Tekstprintln(sptext);
// sprintf(sptext,"          NoExUl: %s", Mem.NoExUl ? "ON" : "OFF");         Tekstprintln(sptext);
 byte wc=Mem.WIFIcredentials; 
 sprintf(sptext," WIFIcredentials: %s", wc==0? "Not SET" : wc==1? "SET" : wc==2? "SET&OK": 
                                   wc==3? "in AP not SET":"Unknown code");  Tekstprintln(sptext);
 sprintf(sptext,"      IntFuture2: %d",Mem.IntFuture2 );                    Tekstprintln(sptext);
 sprintf(sptext,"      IntFuture3: %d",Mem.IntFuture3 );                    Tekstprintln(sptext);
 sprintf(sptext,"     ByteFuture1: %d", Mem.ByteFuture1);                   Tekstprintln(sptext);
 sprintf(sptext,"     ByteFuture2: %d", Mem.ByteFuture2);                   Tekstprintln(sptext);
 sprintf(sptext,"     ByteFuture3: %d", Mem.ByteFuture3);                   Tekstprintln(sptext);
 sprintf(sptext,"     ByteFuture4: %d", Mem.ByteFuture4);                   Tekstprintln(sptext);
 sprintf(sptext,"UseBLELongString: %s",Mem.UseBLELongString?"ON":"OFF");    Tekstprintln(sptext);
 sprintf(sptext,"     Font colour: 0X%08" PRIX32, Mem.OwnColour);           Tekstprintln(sptext);
 sprintf(sptext,"    DimmedLetter: 0X%08" PRIX32,Mem.DimmedLetter );        Tekstprintln(sptext);
 //sprintf(sptext,"      BackGround: 0X%08" PRIX32,Mem.BackGround);           Tekstprintln(sptext);
 sprintf(sptext,"            SSID: %s",Mem.SSID);                           Tekstprintln(sptext);
 // sprintf(sptext,"BackGround: %s",Mem.Password);                          Tekstprintln(sptext);
 sprintf(sptext,"BLEbroadcastName: %s",Mem.BLEbroadcastName);               Tekstprintln(sptext);
 sprintf(sptext,"        Timezone: %s",Mem.Timezone);                       Tekstprintln(sptext);
 sprintf(sptext,"        Checksum: %d",Mem.Checksum);                       Tekstprintln(sptext);
 sptext[0]=0;
}
//--------------------------------------------                                                //
// LDR reading are between 0 and 255. 
// ESP32 analogue read is between 0 - 4096 --   is: 4096 / 8
//--------------------------------------------
int ReadLDR(void)
{
 return analogRead(PhotoCellPin)/16;
}
//--------------------------------------------                                                //
// CLOCK Say the time and load the LEDs 
// with the proper colour and intensity
// If ClearLEDstrip is true a new minute starts
//--------------------------------------------
void Displaytime()
{ 
 ClearScreen();                                                                               // Start by clearing the display to a known state   
 GetTijd(true); //Tekstprintln(""); 
}
//--------------------------------------------                                                //
// CLOCK Dim the leds measured by the LDR and print values
// LDR reading are between 0 and 255. The Brightness send to the LEDs is between 0 and 255
//--------------------------------------------
void DimLeds(bool print) 
{ 
  int LDRread = ReadLDR();                                                                    // ESP32 analoge read is between 0 - 4096, reduce it to 0-1024                                                                                                   
  int LDRavgread = (4 * Previous_LDR_read + LDRread ) / 5;                                    // Read lightsensor and avoid rapid light intensity changes
  Previous_LDR_read = LDRavgread;                                                             // by using the previous reads
  OutPhotocell = (uint32_t)((Mem.LightReducer * sqrt(255*LDRavgread))/100);                   // Linear --> hyperbolic with sqrt. Result is between 0-255
  MinPhotocell = min(MinPhotocell, LDRavgread);                                               // Lowest LDR measurement
  MaxPhotocell = max(MaxPhotocell, LDRavgread);                                               // Highest LDR measurement
  OutPhotocell = constrain(OutPhotocell, Mem.LowerBrightness, Mem.UpperBrightness);           // Keep result between lower and upper boundery en calc percentage
  SumLDRreadshour += LDRavgread;    NoofLDRreadshour++;                                       // For statistics LDR readings per hour
  if(print)
  {
  // sprintf(sptext,"LDR:%3d Avg:%3d (%3d-%3d) Out:%3d=%2d%% Loop(%ld) ",
  //      LDRread,LDRavgread,MinPhotocell,MaxPhotocell,OutPhotocell,(int)(OutPhotocell/2.55),Loopcounter);    
 if (Mem.UseDS3231)   sprintf(sptext,"LDR:%3d=%2d%% %5lld l/s %0.0fC ",
               LDRread,(int)(OutPhotocell*100/255),Loopcounter,RTCklok.getTemperature()); 
 else                 sprintf(sptext,"LDR:%3d=%2d%% %5lld l/s ",
               LDRread,(int)(OutPhotocell*100/255),Loopcounter);   
   Tekstprint(sptext);
   PrintTimeHMS();    
  }

